previous results/ycsb-results-mongocluster1/mongodb/b/rc1000-op1000/tc4/run1.txt
/usr/lib/jvm/java-11-openjdk-11.0.4.11-0.el7_6.x86_64//bin/java  -classpath /mnt/hdd2/nosql-prj/YCSB/YCSB/conf:/mnt/hdd2/nosql-prj/YCSB/YCSB/core/target/core-0.17.0-SNAPSHOT.jar:/mnt/hdd2/nosql-prj/YCSB/YCSB/mongodb/target/mongodb-binding-0.17.0-SNAPSHOT.jar:/mnt/hdd2/nosql-prj/YCSB/YCSB/mongodb/target/dependency/HdrHistogram-2.1.9.jar:/mnt/hdd2/nosql-prj/YCSB/YCSB/mongodb/target/dependency/htrace-core4-4.2.0-incubating.jar:/mnt/hdd2/nosql-prj/YCSB/YCSB/mongodb/target/dependency/logback-classic-1.1.2.jar:/mnt/hdd2/nosql-prj/YCSB/YCSB/mongodb/target/dependency/logback-core-1.1.2.jar:/mnt/hdd2/nosql-prj/YCSB/YCSB/mongodb/target/dependency/mongodb-async-driver-2.0.1.jar:/mnt/hdd2/nosql-prj/YCSB/YCSB/mongodb/target/dependency/mongo-java-driver-3.8.0.jar:/mnt/hdd2/nosql-prj/YCSB/YCSB/mongodb/target/dependency/slf4j-api-1.7.25.jar:/mnt/hdd2/nosql-prj/YCSB/YCSB/mongodb/target/dependency/snappy-java-1.1.7.1.jar com.yahoo.ycsb.Client -t -db com.yahoo.ycsb.db.AsyncMongoDbClient -s -p mongodb.url=mongodb://172.16.13.26:27021 -P /mnt/hdd2/nosql-prj/YCSB/YCSB/workloads/workloadb -p recordcount=1000 -threads 4 -p operationcount=1000
mongo connection created with mongodb://172.16.13.26:27021
10:58:29.636 [Thread-5] INFO  c.a.m.client.state.ClusterPinger - Could not ping 'es-master-01:27017': Connection refused (Connection refused)
[OVERALL], RunTime(ms), 605
[OVERALL], Throughput(ops/sec), 1652.892561983471
[TOTAL_GCS_G1_Young_Generation], Count, 1
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 8
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 1.322314049586777
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 8
[TOTAL_GC_TIME_%], Time(%), 1.322314049586777
[READ], Operations, 948
[READ], AverageLatency(us), 2179.612869198312
[READ], MinLatency(us), 1013
[READ], MaxLatency(us), 55711
[READ], 95thPercentileLatency(us), 3379
[READ], 99thPercentileLatency(us), 5419
[READ], Return=OK, 948
[CLEANUP], Operations, 4
[CLEANUP], AverageLatency(us), 563.75
[CLEANUP], MinLatency(us), 4
[CLEANUP], MaxLatency(us), 2223
[CLEANUP], 95thPercentileLatency(us), 2223
[CLEANUP], 99thPercentileLatency(us), 2223
[UPDATE], Operations, 52
[UPDATE], AverageLatency(us), 2338.980769230769
[UPDATE], MinLatency(us), 1282
[UPDATE], MaxLatency(us), 5071
[UPDATE], 95thPercentileLatency(us), 3887
[UPDATE], 99thPercentileLatency(us), 4243
[UPDATE], Return=OK, 52